Програма писалась на системе GNU/Linux на языке C++. Так как
были использованы средства только стандартной библиотеки C++
и библиотеке Qt, то возможна компиляция и сборка как при помощи
системы разработки GCC, так и любой другой системы программирования,
при условии наличия указанных библиотек разработки.

LINUX:

Для компиляции и сборки программы, выполните:
qmake-qt4 qPaint.pro -spec linux-g++ -r && make -w

Для запуска:
./qPaint [Аргументы]

Аргументы указаны в файле README.


OTHER:

Для компиляции рекомендуется использовать среду разработки QtCreator.
Достаточно открыть в программе QtCreator файл ./qPaint.pro и запустить
сборку проекта.

В случае использования другой среды, поддерживающей библиотеку Qt,
необходимо создать Qt проект и добавить в него ВСЕ файлы с расширением
*.h  и *.cpp, находящиеся во всех дирикториях и поддирикториях ./src
(возможно, придется так же добавить файлы форм *.ui).

Скомпилируйте и запустите скомпилированный файл.


qPaint.pro:

Некоторые параметры компиляции можно настроить в файле qPaint.pro.

Раскомментируйте строчку
#CONFIG+=debug
для компиляции в режиме отладки.

Для использования не сепарабельного фильтра гауса,
закомментируйте строчку
DEFINES+=Use_Separable_Gauss

Для чуть более быстрой работы фильтров закооментируйте строчку
DEFINES+=Virtual_Callback
и разкомментируйте
#DEFINES+=Inline_Callback
в этом случае некоторые фильтры будут дважды "пробегать" строку состояния.